In [1]:
import pandas as pd
import numpy as np
from sklearn.naive_bayes import GaussianNB   #import Gaussian Bayes modeling function
#from sklearn.cross_validation import train_test_split
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score
#import Bernoulli Na√Øve Bayes function from scikit-learn library
from sklearn.naive_bayes import BernoulliNB

In [2]:
location = "datasets/titanic.xls"

df = pd.read_excel(location)
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [5]:
missing_age = df.loc[df['age'].isnull()]
missing_age.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
15,1,0,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
37,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,0,0,111427,26.5500,NaN,S,9,NaN,"Los Angeles, CA"
40,1,0,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C,NaN,NaN,"Philadelphia, PA"
46,1,0,"Cairns, Mr. Alexander",male,NaN,0,0,113798,31.0000,NaN,S,NaN,NaN,NaN
59,1,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,NaN,0,0,17770,27.7208,NaN,C,5,NaN,"New York, NY"

In [6]:
mals = list(missing_age.index)
df['age'].fillna(df.groupby(['survived', 'sex', 'pclass'])['age'].transform('mean'), inplace=True)
df.iloc[mals].head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
15,1,0,"Baumann, Mr. John D",male,43.658163,0,0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
37,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,36.168240,0,0,111427,26.5500,NaN,S,9,NaN,"Los Angeles, CA"
40,1,0,"Brewe, Dr. Arthur Jackson",male,43.658163,0,0,112379,39.6000,NaN,C,NaN,NaN,"Philadelphia, PA"
46,1,0,"Cairns, Mr. Alexander",male,43.658163,0,0,113798,31.0000,NaN,S,NaN,NaN,NaN
59,1,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,37.109375,0,0,17770,27.7208,NaN,C,5,NaN,"New York, NY"

In [7]:
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [8]:
embark = df.loc[df['embarked'].isnull()]
embark

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
168,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN,6,NaN,NaN
284,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN,6,NaN,"Cincinatti, OH"

In [9]:
df['embarked'].value_counts()

S    914
C    270
Q    123
Name: embarked, dtype: int64

In [10]:
embarkls = list(embark.index)
df['embarked'].fillna('S', inplace=True)
df.iloc[embarkls]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
168,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,S,6,NaN,NaN
284,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,S,6,NaN,"Cincinatti, OH"

In [12]:
fare = df.loc[df['fare'].isnull()]
fare

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1225,3,0,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,NaN,S,NaN,261.0,NaN

In [13]:
df.groupby(['survived', 'sex', 'pclass'])['fare'].mean()

survived  sex     pclass
0         female  1         117.054180
                  2          19.125000
                  3          18.367162
          male    1          68.436192
                  2          19.857334
                  3          12.134521
1         female  1         109.137500
                  2          23.759486
                  3          12.166510
          male    1          72.697546
                  2          20.183000
                  3          13.977496
Name: fare, dtype: float64

In [14]:
mfls = list(fare.index)
df['fare'].fillna(df.groupby(['survived', 'sex', 'pclass'])['fare'].transform('mean'), inplace=True)
df.iloc[mfls].head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1225,3,0,"Storey, Mr. Thomas",male,60.5,0,0,3701,12.134521,NaN,S,NaN,261.0,NaN

In [15]:
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin        1014
embarked        0
boat          823
body         1188
home.dest     564
dtype: int64

In [16]:
modeldf = df.drop(['name','ticket','cabin','boat','body','home.dest'], axis=1)
modeldf.head()

   pclass  survived     sex      age  sibsp  parch      fare embarked
0       1         1  female  29.0000      0      0  211.3375        S
1       1         1    male   0.9167      1      2  151.5500        S
2       1         0  female   2.0000      1      2  151.5500        S
3       1         0    male  30.0000      1      2  151.5500        S
4       1         0  female  25.0000      1      2  151.5500        S

In [17]:
modeldf['sex'] = modeldf['sex'].map({'female':0, 'male':1})
modeldf.head()

   pclass  survived  sex      age  sibsp  parch      fare embarked
0       1         1    0  29.0000      0      0  211.3375        S
1       1         1    1   0.9167      1      2  151.5500        S
2       1         0    0   2.0000      1      2  151.5500        S
3       1         0    1  30.0000      1      2  151.5500        S
4       1         0    0  25.0000      1      2  151.5500        S

In [18]:
modeldf = pd.get_dummies(data=modeldf, columns=['embarked'])
modeldf.head()

,pclass,survived,sex,age,sibsp,parch,fare,embarked_C,embarked_Q,embarked_S
0,1,1,0,29.0000,0,0,211.3375,0,0,1
1,1,1,1,0.9167,1,2,151.5500,0,0,1
2,1,0,0,2.0000,1,2,151.5500,0,0,1
3,1,0,1,30.0000,1,2,151.5500,0,0,1
4,1,0,0,25.0000,1,2,151.5500,0,0,1

In [19]:
modeldf['family_num'] = modeldf['sibsp'] + modeldf['parch']
modeldf.drop(['sibsp', 'parch'], axis=1, inplace=True)
modeldf.head()

,pclass,survived,sex,age,fare,embarked_C,embarked_Q,embarked_S,family_num
0,1,1,0,29.0000,211.3375,0,0,1,0
1,1,1,1,0.9167,151.5500,0,0,1,3
2,1,0,0,2.0000,151.5500,0,0,1,3
3,1,0,1,30.0000,151.5500,0,0,1,3
4,1,0,0,25.0000,151.5500,0,0,1,3

In [21]:
modeldf.rename(columns={'embarked_C':'embC','embarked_Q':'embQ','embarked_S':'embS'}, inplace=True)
modeldf.head()

   pclass  survived  sex      age      fare  embC  embQ  embS  family_num
0       1         1    0  29.0000  211.3375     0     0     1           0
1       1         1    1   0.9167  151.5500     0     0     1           3
2       1         0    0   2.0000  151.5500     0     0     1           3
3       1         0    1  30.0000  151.5500     0     0     1           3
4       1         0    0  25.0000  151.5500     0     0     1           3

In [22]:
modeldf.count()

pclass        1309
survived      1309
sex           1309
age           1309
fare          1309
embC          1309
embQ          1309
embS          1309
family_num    1309
dtype: int64

In [24]:
modeldf.dtypes

pclass          int64
survived        int64
sex             int64
age           float64
fare          float64
embC            uint8
embQ            uint8
embS            uint8
family_num      int64
dtype: object

In [25]:
modeldf.corr()

,pclass,survived,sex,age,fare,embC,embQ,embS,family_num
pclass,1.000000,-0.312469,0.124617,-0.444002,-0.558705,-0.269658,0.230491,0.091320,0.050027
survived,-0.312469,1.000000,-0.528693,-0.060032,0.244438,0.182123,-0.016071,-0.150542,0.026876
sex,0.124617,-0.528693,1.000000,0.080752,-0.185704,-0.066564,-0.088651,0.115193,-0.188583
age,-0.444002,-0.060032,0.080752,1.000000,0.195693,0.082706,-0.085716,-0.018446,-0.206087
fare,-0.558705,0.244438,-0.185704,0.195693,1.000000,0.286382,-0.129945,-0.170088,0.226625
embC,-0.269658,0.182123,-0.066564,0.082706,0.286382,1.000000,-0.164166,-0.778262,-0.036553
embQ,0.230491,-0.016071,-0.088651,-0.085716,-0.129945,-0.164166,1.000000,-0.491656,-0.087190
embS,0.091320,-0.150542,0.115193,-0.018446,-0.170088,-0.778262,-0.491656,1.000000,0.087771
family_num,0.050027,0.026876,-0.188583,-0.206087,0.226625,-0.036553,-0.087190,0.087771,1.000000

### Gaussian Na√Øve Bayes

In [77]:
X = modeldf.drop('survived', axis=1)
y = modeldf['survived']

In [78]:
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=109)

In [79]:
gnb = GaussianNB()

In [29]:
gnb.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [30]:
#predictive score of the model on the training data
gnb.score(X_train, y_train)

0.7726809378185525

In [31]:
#test the model on unseen data
#score predictive values in variable
y_pred = gnb.predict(X_test)

In [32]:
cm = pd.DataFrame(
    confusion_matrix(y_test, y_pred),
    columns=['Predicted Perished', 'Predicted Survived'],
    index=['True Perished', 'True Survived']
)

cm

               Predicted Perished  Predicted Survived
True Perished                 180                  20
True Survived                  53                  75

In [33]:
y_test.value_counts()

0    200
1    128
Name: survived, dtype: int64

In [34]:
gnb.score(X_test, y_test)

0.7774390243902439

In [35]:
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.77      0.90      0.83       200
           1       0.79      0.59      0.67       128

    accuracy                           0.78       328
   macro avg       0.78      0.74      0.75       328
weighted avg       0.78      0.78      0.77       328

### Bernoulli's Na√Øve Bayes

In [36]:
bnb = BernoulliNB()

In [80]:
bnb.fit(X_train, y_train)

BernoulliNB(alpha=1.0, binarize=0.0, class_prior=None, fit_prior=True)

In [81]:
bnb.score(X_train, y_train)

0.7726809378185525

In [82]:
y_pred = bnb.predict(X_test)

In [83]:
cm = pd.DataFrame(
    confusion_matrix(y_test, y_pred),
    columns=['Predicted Perished', 'Predicted Survived'],
    index=['True Perished', 'True Survived']
)

cm

               Predicted Perished  Predicted Survived
True Perished                 162                  38
True Survived                  39                  89

In [84]:
bnb.score(X_test, y_test)

0.7652439024390244

In [85]:
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.81      0.81      0.81       200
           1       0.70      0.70      0.70       128

    accuracy                           0.77       328
   macro avg       0.75      0.75      0.75       328
weighted avg       0.76      0.77      0.77       328

##### Between the two Na√Øve Bayes models, Gaussian is slightly better at guessing who didn't make it and Bernoulli's is slightly better at guessing who survived. Just slightly. Both models' predictions were pretty decent overall.

### Logistic Regression

In [44]:
from sklearn.linear_model import LogisticRegression

In [45]:
LogReg = LogisticRegression()
LogReg.fit(X_train, y_train)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [46]:
LogReg.score(X_train, y_train)

0.8042813455657493

In [47]:
y_pred = LogReg.predict(X_test)

In [57]:
cm = pd.DataFrame(
    confusion_matrix(y_test, y_pred),
    columns=['Predicted Perished', 'Predicted Survived'],
    index=['True Perished', 'True Survived']
)

cm

               Predicted Perished  Predicted Survived
True Perished                 176                  24
True Survived                  45                  83

In [49]:
LogReg.score(X_test, y_test)

0.7896341463414634

In [50]:
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.80      0.88      0.84       200
           1       0.78      0.65      0.71       128

    accuracy                           0.79       328
   macro avg       0.79      0.76      0.77       328
weighted avg       0.79      0.79      0.79       328

##### Linear Regression is slightly better than Na√Øve Bayes overall and is noticably better at predicting if someone survived (based on recall).

### Decision Tree

In [51]:
from sklearn import tree

In [52]:
tree = tree.DecisionTreeClassifier()

In [53]:
tree.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [54]:
tree.score(X_train, y_train)

0.9877675840978594

In [55]:
y_predict = tree.predict(X_test)

In [56]:
tree.score(X_test, y_test)

0.75

In [58]:
cm = pd.DataFrame(
    confusion_matrix(y_test, y_pred),
    columns=['Predicted Perished', 'Predicted Survived'],
    index=['True Perished', 'True Survived']
)

cm

               Predicted Perished  Predicted Survived
True Perished                 176                  24
True Survived                  45                  83

In [59]:
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.80      0.88      0.84       200
           1       0.78      0.65      0.71       128

    accuracy                           0.79       328
   macro avg       0.79      0.76      0.77       328
weighted avg       0.79      0.79      0.79       328

##### The Decision Tree model performed exactly the same as the Linear Regression model.

## Bonus Version: Fewer Columns

In [61]:
model2df = modeldf.drop(['embC','embS','embQ','family_num'], axis=1)
model2df.head()

   pclass  survived  sex      age      fare
0       1         1    0  29.0000  211.3375
1       1         1    1   0.9167  151.5500
2       1         0    0   2.0000  151.5500
3       1         0    1  30.0000  151.5500
4       1         0    0  25.0000  151.5500

In [63]:
model2df.corr()

            pclass  survived       sex       age      fare
pclass    1.000000 -0.312469  0.124617 -0.444002 -0.558705
survived -0.312469  1.000000 -0.528693 -0.060032  0.244438
sex       0.124617 -0.528693  1.000000  0.080752 -0.185704
age      -0.444002 -0.060032  0.080752  1.000000  0.195693
fare     -0.558705  0.244438 -0.185704  0.195693  1.000000

In [64]:
X = model2df.drop('survived', axis=1)
y = model2df['survived']

In [65]:
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=109)

#### Gaussian Na√Øve Bayes

In [66]:
gnb.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [67]:
gnb.score(X_train, y_train)

0.7706422018348624

In [68]:
y_pred = gnb.predict(X_test)

In [69]:
cm = pd.DataFrame(
    confusion_matrix(y_test, y_pred),
    columns=['Predicted Perished', 'Predicted Survived'],
    index=['True Perished', 'True Survived']
)

cm

               Predicted Perished  Predicted Survived
True Perished                 162                  38
True Survived                  41                  87

In [70]:
gnb.score(X_test, y_test)

0.7591463414634146

In [71]:
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.80      0.81      0.80       200
           1       0.70      0.68      0.69       128

    accuracy                           0.76       328
   macro avg       0.75      0.74      0.75       328
weighted avg       0.76      0.76      0.76       328

#### Bernoulli's Na√Øve Bayes

In [72]:
bnb.fit(X_train, y_train)

BernoulliNB(alpha=1.0, binarize=0.0, class_prior=None, fit_prior=True)

In [73]:
bnb.score(X_train, y_train)

0.7849133537206932

In [74]:
y_pred = bnb.predict(X_test)

In [75]:
bnb.score(X_test, y_test)

0.7652439024390244

In [76]:
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.78      0.85      0.82       200
           1       0.73      0.63      0.68       128

    accuracy                           0.77       328
   macro avg       0.76      0.74      0.75       328
weighted avg       0.76      0.77      0.76       328

##### No significant difference from the first models. If anything, they're a slight bit worse.

In [88]:
df.groupby(['embarked'])['survived'].sum()

embarked
C    150
Q     44
S    306
Name: survived, dtype: int64

In [89]:
len(df)

1309

In [90]:
df['embarked'].value_counts()

S    916
C    270
Q    123
Name: embarked, dtype: int64

In [91]:
C = 150/270
print(C)
Q = 44/123
print(Q)
S= 306/916
print(S)

0.5555555555555556
0.35772357723577236
0.33406113537117904

##### Okay just a side note, how come more than half of the people from Cherbourg, France survived?

In [93]:
Cdf = df.loc[df['embarked'] == 'C']

In [96]:
Cdf.groupby(['sex'])['survived'].sum()

sex
female    102
male       48
Name: survived, dtype: int64

In [100]:
df.groupby(['sex'])['survived'].sum()

sex
female    339
male      161
Name: survived, dtype: int64

In [97]:
Cdf.groupby(['pclass'])['survived'].sum()

pclass
1    97
2    16
3    37
Name: survived, dtype: int64

In [101]:
df.groupby(['pclass'])['survived'].sum()

pclass
1    200
2    119
3    181
Name: survived, dtype: int64

##### Oh, it's because like half of first class was from Cherbourg and very few people from Cherbourg were in other classes, and even then, the ones that were made up just a small percentage of the total number of second and third class passengers. Everything makes sense again.